Invalid family type "[Type Name]".
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId InvalidFamilyType { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidFamilyType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidFamilyType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace